#include <iostream>
#include "Person.h"
//Написати клас Особи, в якому мають бути передбачені наступні захищені поля:
//1) унікальний ідентифікатор можна зробити за прикладом РНОКПП ;
//2) ім’я;
//3) прізвище;
//4) номер паспорта;
//5) дата народження;
//6) додаткові відомості;
//напишіть для них публічні методи, які дозволяють отримувати доступ на читання і зміну.
//На основі попереднього класу створіть успадкований клас Студенти. Особливістю нового класу має бути те, що
//студент навчається. Тому треба додати поля:
//7) навчальний заклад
//8) спеціальність
//9) група.
//В головній програмі створіть групу студентів і виведіть її список на екран.



int main() {
    Person person;
    person.showAll();
    person.setUniqueIdentifier(1234567891);
    person.getUniqueIdentifier();
    return 0;
}
